/**** FileVault Strings and Formatting *****/

/* The format string used to generate the text label that appears in the FileVault conversion progress window when it is showing the progress of a user's home folder getting encrypted.  The %@ is replaced by the user's full name. */
"ENCRYPTING_MESSAGE_FORMAT" = "A cifrar a pasta pessoal de %@";

/* The format string used to generate the text label that appears in the FileVault conversion progress window when it is showing the progress of a user's home folder getting decrypted.  The %@ is replaced by the user's full name. */
"DECRYPTING_MESSAGE_FORMAT" = "A decifrar a pasta pessoal de %@";

/* The format string used to generate the text label that appears in the FileVault progress window when it is showing the progress of a user's home folder getting compacted.  The %@ is replaced by the user's full name. */
"COMPACTING_MESSAGE_FORMAT" = "A recuperar espaço em disco da pasta pessoal de %@";

/* The format string used to generate the text label that appears in the FileVault progress window when it is showing the progress of a user's home folder being backed up by TimeMachine.  The %@ is replaced by the user's full name. */
"BACKINGUP_MESSAGE_FORMAT" = "A efectuar cópia de segurança da pasta pessoal de %@";

"CONVERTING_MESSAGE_FORMAT" = "A converter a pasta pessoal de %@";

/* The following strings appear below the progress bar in the FileVault conversion progress window to indicate the various phases of the conversion process. */
"PHASE_PREPARING" = "A preparar...";
"PHASE_CREATING_IMAGE" = "A criar FileVault...";
"PHASE_MOUNTING_IMAGE" = "A montar FileVault...";
"PHASE_COPYING_TO_IMAGE" = "A copiar o conteúdo da pasta pessoal para o FileVault...";
"PHASE_COPY_COMPLETE" = "A cópia foi concluída...";
"PHASE_UPDATING_USER_RECORD" = "A actualizar registo do utilizador...";
"PHASE_UNMOUNTING_IMAGE" = "A desmontar FileVault...";
"PHASE_DELETING_OLD_HOME" = "A apagar a pasta pessoal anterior...";
"PHASE_SECURE_ERASING_OLD_HOME" = "A apagar pasta pessoal anterior com segurança…";
"PHASE_CANCELLING" = "A cancelar...";
"PHASE_PAUSED" = "Em pausa";
"PHASE_COMPACTING" = "A recuperar espaço em disco...";
"PHASE_BACKINGUP" = "A efectuar cópia de segurança...";

/* The following strings are time estimates that appear below the progress bar in the FileVault conversion progress window */
"TIME_EST_ESTIMATING" = "A calcular...";
"TIME_EST_ABOUT_5_SECONDS" = "Cerca de 5 segundos";
"TIME_EST_ABOUT_10_SECONDS" = "Cerca de 10 segundos";
"TIME_EST_UNDER_A_MINUTE" = "Menos de um minuto";
"TIME_EST_ABOUT_A_MINUTE" = "Cerca de um minuto";
"TIME_EST_ABOUT_N_MINUTES" = "Cerca de %d minutos";
"TIME_EST_ABOUT_ONE_HOUR" = "Cerca de 1 hora";
"TIME_EST_ABOUT_ONE_HOUR_N_MINUTES" = "Cerca de 1 hora e %d minutos";
"TIME_EST_ABOUT_PLURAL_HOURS" = "Cerca de %d horas";
"TIME_EST_ABOUT_PLURAL_HOURS_PLURAL_MINUTES" = "Cerca de %1$d horas e %2$d minutos";


"TIME_REMAINING_FORMAT" = "Tempo que falta: %@";
"CANCEL_BUTTON_LABEL" = "Cancelar";

/* The following strings are used to construct the confirmation alert that is presented when a user clicks the Cancel button in the FileVault progress window. */

"CANCEL_CONFIRMATION_STOP_BUTTON" = "Parar";
"CANCEL_CONFIRMATION_CONTINUE_BUTTON" = "Continuar";
"CANCEL_ENCRYPT_CONFIRMATION_MESSAGE" = "Parar o FileVault?";
"CANCEL_ENCRYPT_CONFIRMATION_INFO" = "O FileVault não terminou de cifrar a pasta pessoal. Se interromper agora, o FileVault será desactivado nesta pasta pessoal, que não será cifrada.";
"CANCEL_DECRYPT_CONFIRMATION_MESSAGE" = "Parar o FileVault?";
"CANCEL_DECRYPT_CONFIRMATION_INFO" = "O FileVault não terminou de decifrar a pasta pessoal. Se interromper agora, o FileVault será activado nesta pasta pessoal, que continuará cifrada.";

/* The following strings are used to construct the confirmation alert that is presented when a user when a compact is necessary during log out. */

"COMPACT_CONFIRMATION_CONTINUE_BUTTON" = "Continuar";
"COMPACT_CONFIRMATION_SKIP_NOW_BUTTON" = "Ignorar agora";

"COMPACT_CONFIRMATION_MESSAGE" = "A sua pasta pessoal, que se encontra protegida pelo FileVault, está a utilizar mais espaço em disco que o necessário. Este espaço pode ser recuperado. Gostaria de continuar?";

"COMPACT_CONFIRMATION_INFO" = "Clicando em Continuar, o FileVault recuperará o espaço em disco não utilizado. Embora este processo demore algum tempo, é conveniente que o efectue agora.";


/* Error Alert strings */
"FV_ERROR_OK_BUTTON" = "OK";
"FV_ERROR_TITLE" = "Ocorreu um erro";
"FILEVAULT_ENCRYPT_ERROR_MESSAGE" = "Ocorreu um erro ao cifrar (%@). O FileVault não será activado nesta conta.";
"FILEVAULT_DECRYPT_ERROR_MESSAGE" = "Ocorreu um erro ao decifrar (%@). O FileVault não será desactivado nesta conta.";
"FV_COULD_NOT_CREATE_IMAGE" = "Não foi possível criar a imagem FileVault";
"FV_COULD_NOT_CREATE_MOUNT_POINT_DIR" = "Impossível criar directório de ponto de montagem temporário";
"FV_COULD_NOT_MOUNT_IMAGE_FOR_COPYING" = "Não foi possível montar a imagem FileVault para cópia";
"FV_ERROR_OCCURRED_DURING_COPY" = "Ocorreu um erro durante a cópia.";
"FV_COULD_NOT_MOUNT_IMAGE_FOR_VERIFICATION" = "Não foi possível montar a imagem FileVault para verificação";
"FV_VERIFICATION_FAILED" = "A verificação falhou";
"FV_COULD_NOT_UNMOUNT_IMAGE" = "Não foi possível desmontar a imagem FileVault";
"FV_ERROR_DEFAULT" = "Erro %d";

"FV_SECURE_ERASE_FINISHED_TITLE" = "A pasta pessoal anterior foi apagada com segurança.";
"FV_SECURE_ERASE_FINISHED_INFO" = "A protecção FileVault está activa nesta conta e o conteúdo da pasta pessoal está cifrado.";
"FV_SECURE_ERASE_FAILED_TITLE" = "Ocorreu um problema ao eliminar a pasta pessoal anterior durante a conversão FileVault.";
"FV_SECURE_ERASE_FAILED_INFO" = "O processo falhou antes de a pasta pessoal anterior poder ser totalmente apagada.";
"FV_CONTINUE_TITLE" = "Tem a certeza de que pretende continuar a apagar em segundo plano a pasta pessoal anterior?";
"FV_CONTINUE_INFO" = "Se clicar em OK, o FIleVault continuará a apagar a pasta pessoal anterior em segurança, sem interromper o seu trabalho. Para consultar o estado do processo, abra o painel Segurança, das Preferências do Sistema.";